'''
给你一个整数数组 nums，有一个大小为 k 的滑动窗口从数组的最左侧移动到数组的最右侧。你只可以看到在滑动窗口内的 k 个数字。滑动窗口每次只向右移动一位。
返回 滑动窗口中的最大值 。

示例 1：
输入：nums = [1,3,-1,-3,5,3,6,7], k = 3
输出：[3,3,5,5,6,7]
解释：
滑动窗口的位置                最大值
---------------               -----
[1  3  -1] -3  5  3  6  7       3
 1 [3  -1  -3] 5  3  6  7       3
 1  3 [-1  -3  5] 3  6  7       5
 1  3  -1 [-3  5  3] 6  7       5
 1  3  -1  -3 [5  3  6] 7       6
 1  3  -1  -3  5 [3  6  7]      7

示例 2：
输入：nums = [1], k = 1
输出：[1]
 '''

# 滑动窗口最大值

class Solution:
    def maxSlidingWindow(self, nums: List[int], k: int) -> List[int]:
        ans=[0]*(len(nums)-k+1)#窗口数
        q=deque() #双端队列
        for i,x in enumerate(nums):
            #右边入
            while q and nums[q[-1]]<=x:
                q.pop() #维护q的单调性
            q.append(i) #保存的是下标，这样下面可以判断队首是否离开窗口
            #左边出
            left=i-k+1 #窗口左端点
            if q[0]<left:#队首离开窗口
                q.popleft()
            #在窗口左端点处记录答案
            if left>=0:
                #对首到队尾单调递减，所以窗口最大值就在队首
                ans[left]=nums[q[0]]
        return ans